https://fluxcd.io/flux/guides/mozilla-sops/#prerequisites
** import into kubernetes
#+begin_src shell :env KEY_NAME="k8s.cloudnative.nz"
export KEY_NAME="k8s.cloudnative.nz"
export KEY_FP=$(gpg --list-secret-keys "${KEY_NAME}" | grep SCEAR -A1 | tail -1 | awk '{print $1}')
gpg --export-secret-keys --armor "${KEY_FP}" |
kubectl create secret generic sops-gpg \
--namespace=flux-system \
--from-file=sops.asc=/dev/stdin
#+end_src

#+RESULTS:
#+begin_example
secret/sops-gpg created
#+end_example
